export const searchFormSelectboxOptions = {
    _type : ["تمامی محتواها" , "کاربرگ" , "ویدیو" , "دوره" , "آزمون" , "بازی"],
    _subject :  ["تمامی دروس" , "ریاضی" , "فارسی" , "علوم و آزمایشگاه" , "تاریخ و جغرافیا" , "قرآن و هدیه ها" , "هنر" , "درک مطلب" , "متفرقه"],
    _grade :  ["تمامی پایه ها" , "اول" , "دوم"  , "سوم"  , "چهارم"  , "پنجم"  , "ششم"] ,
    _rating :  ["تمامی امتیازات" , "بالاتر از 4"  , "بالاتر از 3"  , "بالاتر از 2"  , "بالاتر از 1"  , "پایین تر از 1"],
    _author :  ["همه" , "راحت بخون"  , "سازندگان تاییدشده"  , "سازندگان معمولی"],
    videosUserType : [ "تمامی افراد" , "دانش آموز"  , "آموزگار یا دانشجو"  , "والدین"  , "عمومی"],
    coursesUserType : [ "تمامی افراد" , "دانش آموز"  , "آموزگار یا دانشجو"  , "والدین"  , "عمومی"],
    coursesStudentsNum : [ "---" , "پایین تر از 100"  , "از 100 تا 300 نفر"  , "از 301 تا 500 نفر"  , "از 500 تا 1000 نفر"  , "بالاتر از 1000 نفر" ],
    coursesEpisodesNum :  ["---" , "کمتر از 5"  , "از 6 تا 10 قسمت"  , "از 10 تا 20 قسمت"  , "بیش از 20 قسمت"], 
    worksheetType :  ["تمامی کاربرگ ها" , "کاربرگ تمرینی"  , "کاربرگ خلاقانه"  , "کاربرگ پلاس"  , "کاربرگ تستی"],
    worksheetLesson : [ "---" , "با حاشیه"  , "بی حاشیه" , "با قابلیت تغییر حاشیه"],
    worksheetKey :  ["باپاسخ و بی پاسخ" , "با پاسخ"  , "بی پاسخ" ],
    worksheetColor : [ "---" , "رنگی"  , "سیاه و سفید"  , "بدون عکس"],
    worksheetPaper :  ["---" , "1 برگی"  , "2 برگی"  , "3 برگی"  , "4 برگی"  , "بیش از 4 برگ"], 
    worksheetUsability :  ["برای تمرین و آزمون" , "مخصوص آزمون"  , "مخصوص تمرین"  , "با قابلیت تغییر"],
    worksheetRotation : [ "افقی و عمودی" , "عمودی"  , "افقی"],
    testType : ["تمامی سطوح","آزمون های فردی","آزمون های مرحله ای","آزمون های گروهی","جشنواره ها و مسابقات"],
    testLevel : ["تمامی آزمون ها","آسان","متوسط","سخت","خیلی سخت"]
}

export interface searchFormInitialValuesProps {
    
    _type :  "تمامی محتواها" | "کاربرگ" | "ویدیو" | "دوره" | "آزمون" | "بازی"
    _subject : "تمامی دروس" | "ریاضی" | "فارسی" | "علوم و آزمایشگاه" | "قرآن و هدیه ها" | "تاریخ و جغرافیا" | "هنر" | "درک مطلب" | "متفرقه" 
    _grade : "تمامی پایه ها" | "اول" | "دوم"  | "سوم"  | "چهارم"  | "پنجم"  | "ششم" 
    _rating : "تمامی امتیازات" | "بالاتر از 4"  | "بالاتر از 3"  | "بالاتر از 2"  | "بالاتر از 1"  | "پایین تر از 1" 
    _author : "همه" | "راحت بخون"  | "سازندگان تاییدشده"  | "سازندگان معمولی"
    videosUserType : "تمامی افراد" | "دانش آموز"  | "آموزگار یا دانشجو"  | "والدین"  | "عمومی"
    coursesUserType : "تمامی افراد" | "دانش آموز"  | "آموزگار یا دانشجو"  | "والدین"  | "عمومی"
    coursesStudentsNum : "---" | "پایین تر از 100"  | "از 100 تا 300 نفر"  | "از 301 تا 500 نفر"  | "از 500 تا 1000 نفر"  | "بالاتر از 1000 نفر" 
    coursesEpisodesNum : "---" | "کمتر از 5"  | "از 6 تا 10 قسمت"  | "از 10 تا 20 قسمت"  | "بیش از 20 قسمت" 
    worksheetType ?: "تمامی کاربرگ ها" | "کاربرگ تمرینی"  | "کاربرگ خلاقانه"  | "کاربرگ پلاس"  | "کاربرگ تستی"
    worksheetLesson ?: string
    worksheetKey ?: "باپاسخ و بی پاسخ" | "با پاسخ"  | "بی پاسخ" 
    worksheetColor ?: "----" | "رنگی"  | "سیاه و سفید"  | "بدون عکس"
    worksheetPaper ?: "----" | "1 برگی"  | "2 برگی"  | "3 برگی"  | "4 برگی"  | "بیش از 4 برگ" 
    worksheetUsability ?: "برای تمرین و آزمون" | "مخصوص آزمون"  | "مخصوص تمرین"  | "با قابلیت تغییر"
    worksheetRotation ?: "افقی و عمودی" | "عمودی"  | "افقی"
    testType ?: "تمامی سطوح" | "آزمون های فردی" | "آزمون های مرحله ای" | "آزمون های گروهی" | "جشنواره ها و مسابقات"
    testLevel ?: "تمامی آزمون ها" | "آسان" | "متوسط" | "سخت" | "خیلی سخت"

}

export const searchFormInitialValues : searchFormInitialValuesProps = {
    _type : "تمامی محتواها",
    _subject : "تمامی دروس",
    _grade : "تمامی پایه ها",
    _rating : "تمامی امتیازات",
    _author : "همه",
    videosUserType : "تمامی افراد", 
    coursesUserType : "تمامی افراد", 
    coursesStudentsNum : "---",
    coursesEpisodesNum : "---", 
    worksheetType : "تمامی کاربرگ ها",
    worksheetLesson : "----",
    worksheetKey : "باپاسخ و بی پاسخ",
    worksheetColor : "----",
    worksheetPaper : "----",
    worksheetUsability : "برای تمرین و آزمون",
    worksheetRotation : "افقی و عمودی",
    testType : "تمامی سطوح",
    testLevel : "تمامی آزمون ها"

}