

export const filtersInfo = {
     sort : [
          "پیش فرض",
          "جدیدترین",
          "پربازدیدترین",
          "پربحث ترین",
          "محبوب ترین",
          "ارزان ترین",
          "گران ترین",
     ],
     videosUserType : [
          "تمامی افراد",
          "دانش آموز",
          "آموزگار یا دانشجو",
          "والدین",
          "عمومی"
     ],
     book : [
         "تمامی دروس",
         "ریاضی",
         "فارسی",
         "علوم و آزمایشگاه",
         "تاریخ و جغرافیا",
         "قرآن و هدیه ها",
         "هنر",
         "درک مطلب",
         "متفرقه"
     ],
     type : [
          "تمامی دوره ها",
          "رایگان",
          "اعضای ویژه",
          "دوره های نقدی"
     ],
}