

export const worksheetFilters = () => {}


export const gradeOneFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب","نگاره‌ی 1: به خانه‌ی ما خوش آمدی", "نگاره‌ 2: بچه ها، آماده!", "نگاره‌ی 3: یک٬ دو و سه راه مدرسه", "نگاره‌ی 4: به مدرسه رسیدیم", "نگاره‌ی 5: از کلاس ما چه خبر؟", "نگاره‌ی 6: بازی، بازی، تماشا", "نگاره‌ی 7: به به چه روستایی", "نگاره‌ی 8: چه دنیای قشنگی", "نگاره‌ی 9: در مسجد محله", "نگاره‌ی 10: نوروز در خانه‌ی ما", "درس 1: آ ا ــ بـ ب", "درس 2: اَ ـَ ــ د", "درس 3: مـ م ــ سـ س", "درس 4: او و ــ تـ ت", "درس 5: ر ــ نـ ن", "درس 6: ایـ یـ ی ای ــ ز", "درس 7: اِ ـِ ــ ـه ه ــ شـ ش", "درس 8: یـ ى ــ اُ ـُ", "درس 9: کـ ک ــ و", "درس 10: پـ پ ــ گـ گ", "درس 11: فـ ف ــ خـ خ", "درس 12: قـ ق ــ لـ ل", "درس 13: جـ ج ــ ـُ استثنا", "درس 14: هـ ـهـ ـه ه ــ چـ چ", "درس 15: ژ ــ خوا", "درس 16: در بازار ” تشدید ـّ “", "درس 17: صدایِ موج ”صـ ص“ ــ سفرِ دلپذیر ”ذ“", "درس 18: علی و معصومه ”عـ ـعـ ـع ع“ ــ مثلِ خورشید ”ثـ ث“", "درس 19: حَلَزون ”حـ ح“", "درس 20: رضا ”ضـ ض“ ــ خاطرات انقلاب ”ط“", "درس 21: لاک‌پشت و مرغابی‌ها ”غـ ـغـ ـغ غ“", "درس 22: پیامبر مهربان “ظ”"],
     math : ["همه", "نوبت اول", "دوره کل کتاب","شمارش اشیاء", "شمارش از روی شکل بدون شمردن", "اضافه کردن", "نوشتن اعداد", "مقدمه بر هندسه", "آموزش جمع و تفریق", "الگوی شطرنجی", "هندسه، تقارن، قرینه و اشکال هندسی"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","درس اول : به نـام خـدا، بـسـم اللّه", "درس دوم : نعـمت هـای خدا", "درس سوم : خانـه ی مـا", "درس چهارم : قـرآن بـخـوانــيم", "درس پنجم : کودک مسـلمان", "درس ششم : مدرسـه ی ما", "درس هفتم : پيامبـران خـدا", "درس آخر : در تـابـسـتان نيز قرآن بخوانيم"],
     sience : ["همه", "نوبت اول", "دوره کل کتاب","فصل 1: زنگ علوم", "فصل 2: سلام، به من نگاه کن!", "فصل 3: سالم باش، شاداب باش", "فصل 4: دنیای جانوران", "فصل 5: دنیای گیاهان", "فصل 6: زمین خانه ی پر آب ما", "فصل 7: زمین خانه ی سنگی ما", "فصل 8: چه می خواهم بسازم؟", "فصل 9: زمین خانه ی خاکی ما", "فصل 10: در اطراف ما هوا وجود دارد", "فصل 11: دنیای سرد و گرم", "فصل 12: از خانه تا مدرسه", "فصل 13: آهن ربای من", "فصل 14: از گذشته تا آینده"],
     art : ['همه'],
}

export const gradeTwoFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: نهادها", "فصل دوم: بهداشت", "فصل سوم: اخلاق فردی و اجتماعی", "فصل چهارم: راه زندگی", "فصل پنجم: هنر و ادب", "درس یازدهم: درس آزاد", "فصل ششم: ایران من", "فصل هفتم: طبیعت"] ,
     math : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: مرور ریاضی پایه اول", "فصل دوم: جمع و تفریق اعداد دو رقمی", "فصل سوم: آموزش اشکال هندسی", "فصل چهارم: آشنایی با مفاهیم اندازه گیری", "فصل پنجم: جمع و تفریق اعداد سه رقمی", "فصل ششم : جدول یکان ها و صدگان ها", "فصل هفتم: آموزش کسر و احتمال", "فصل آخر: سرشماری و انواع نمودار"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: الف کوچک، سکون", "درس دوم: تشدید، اتصالات", "درس سوم: سورۀ حمد", "درس چهارم: سورۀ ناس", "درس پنجم: سورۀ فلق", "درس ششم: سورۀ توحید", "درس هفتم: سورۀ نصر", "درس هشتم: سورۀ کوثر", ["درس اول: هدیه های خدا", "درس دوم: پرندگان چه می گویند؟", "درس سوم: خاطره ی ماه", "درس چهارم: مهربان‌تر از مادر", "درس پنجم: می خواهم وضو بگیرم", "درس ششم: پیامبران خدا", "درس هفتم: مهمان کوچک", "درس هشتم: جشن میلاد", "درس نهم: اهل بیت پیامبر", "درس دهم: خانواده ی مهربان", "درس یازدهم: نماز بخوانیم", "درس دوازدهم: پدر مهربان", "درس سیزدهم: بهترین دوست", "درس چهاردهم: دعای باران", "درس پانزدهم: بچه ها سلام!", "درس شانزدهم: طبیعت زیبا", "درس هفدهم: وقت نماز", "درس هجدهم: راه خوش بختی", "درس نوزدهم: جشن بزرگ", "درس بیستم: در کنار سفره"]],
     sience : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: زنگ علوم (گردشی در باغ)", "فصل دوم: هوای سالم، آب سالم", "فصل سوم: زندگی ما و گردش زمین (1)", "فصل چهارم: زندگی ما و گردش زمین (2)", "فصل پنجم: پیام رمز را پیدا کن (1)", "فصل ششم: پیام رمز را پیدا کن (2)", "فصل هفتم: اگر تمام شود …", "فصل هشتم: بسازیم و لذت ببریم", "فصل نهم: سرگذشت دانه", "فصل دهم: درون آشیانه ها", "فصل یازدهم: من رشد می‌کنم", "فصل دوازدهم: برای جشن آماده شویم", "فصل سیزدهم: بعد از جشن", "فصل چهاردهم: از گذشته تا آینده (نان)"],
     art : ['همه'],
}

export const gradeThreeFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: نهادها آشنایی با نهادهای اجتماعی، فرهنگی و ورزشی", "فصل دوم: بهداشت آشنایی با بهداشت و فواید آن", "فصل سوم: اخلاق فردی و اجتماعی", "فصل چهارم: راه زندگی", "فصل پنجم: هنر و ادب", "فصل ششم: ایران من", "فصل هفتم: طبیعت" , 'درس آزاد'],
     math : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: الگوها", "فصل دوم: عددهاي چهار رقمی", "فصل سوم: عددهای کسری", "فصل چهارم: ضرب و تقسيم", "فصل پنجم: محيط و مساحت", "فصل ششم: جمع و تفریق", "فصل هفتم: آمار و احتمال", "فصل هشتم: ضرب عددها"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: آموزش نماز", "فصل دوم: آموزش روخوانی قرآن کریم", "فصل سوم: انس با قرآن کریم", "درس اول: آستین‌های خالی", "درس دوم: غروب یک روز بهاری", "درس سوم: هميشه با من", "درس چهارم: در کاخ نمرود", "درس پنجم: روز دهم", "درس ششم: بانوي قهرمان", "درس هفتم: بوی بهشت", "درس هشتم: جشن تکلیف", "درس نهم: گفت گو با خدا", "درس دهم: ماه مهمانی خدا", "درس یازدهم: عید مسلمانان", "درس دوازدهم: سخن آسمانی", "درس سیزدهم: انتخاب پروانه", "درس چهاردهم: ام ابیها", "درس پانزدهم: همسفر ناشناس", "درس شانزدهم: داناترین مردم", "درس هفدهم: خواب شیرین", "درس هجدهم: آینه‌ی سخنگو", "درس نوزدهم: گندم از گندم بروید", "درس بیستم: باغ همیشه بهار"],
     sience : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: زنگ علوم", "درس دوم: خوراکی ها", "درس سوم: مواد اطراف ما", "درس چهارم: اندازه گيري مواد", "درس پنجم: آب ماده اي با ارزش", "درس ششم: زندگی ما و آب", "درس هفتم: نور و مشاهده‌ی اجسام", "درس هشتم: جست و جو کنیم و بسازیم", "درس نهم: نیرو همه جا (1)", "درس دهم: نیرو همه جا (2)", "درس يازدهم: بکاريد و ببينيد", "درس دوازدهم: هر کدام جاي خود (1)", "درس سيزدهم: هر کدام جاي خود (2)", "درس چهاردهم: از گذشته تا آينده"],
     history : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: من بزرگ تر می‌شوم", "فصل دوم: خانواده", "فصل سوم: همکاری در خانواده", "فصل چهارم: نيازهاي خانواده", "فصل پنجم: خانه ي ما", "فصل ششم: مدرسه ي ما", "فصل هفتم: از خانه تا مدرسه"],
     art : ['همه'],
}


export const gradeFourFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: آفرینش آشنایی با آفرینش و تأمل در آن", "فصل دوم: دانایی و هوشیاری توسعه و کار بست تفکّر و تعقّل در زندگی دانش آموزان", "فصل سوم: ایران من تقویت حسّ میهن‌دوستی", "فصل چهارم: فرهنگ بومی", "فصل پنجم: نام‌آوران", "فصل ششم: راه زندگی", "فصل هفتم: ایمان و عمل", "درس آزاد"],
     math : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: اعداد و الگوها", "فصل دوم: کسر", "فصل سوم: ضرب و تقسیم", "فصل چهارم: اندازه گیری", "فصل پنجم: عدد مخلوط و عدد اعشاری", "فصل ششم: شکل های هندسی", "فصل هفتم: آمار و احتمال"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: یادآوری قواعد سالهای قبل", "درس دوم: سوره تغابن", "درس سوم: سوره ابراهیم", "درس چهارم: سوره واقعه", "درس پنجم: سوره آل عمران آیات 102 تا 105", "درس ششم: سوره ی اِسراء", "درس هفتم: آشنایی با خط قرآن کریم", "درس هشتم: سوره آل عِمران آیات ٣٠ تا ٣٧", "درس نهم: سوره بقره", "درس دهم: سوره هود", "درس یازدهم: سوره مُلک", "درس دوازدهم: سوره ی آل عِمران آیات 38 تا 45", "درس سیزدهم: سوره ی نَمل", "درس چهاردهم: سوره ی یوسف", "درس پانزدهم: سوره ی عَبَسَ" , "درس اول: دانه ای که نمی خواست بروید!", "درس دوم: کودکی بر آب", "درس سوم: ما به مسجد می رویم", "درس چهارم: یک نماز و ده رکوع!", "درس پنجم: سخنی که سه بار تکرار شد!", "درس ششم: حرمی با دو گنبد", "درس هفتم: نماز در کوهستان", "درس هشتم: دیدار دوست", "درس نهم: کودک شجاع", "درس دهم: روشن ترین شب", "درس یازدهم", "درس دوازدهم: روزی برای تمام بچه ها", "درس سیزدهم: خاله نرگس", "درس چهاردهم: اولین بانوی مسلمان", "درس پانزدهم: یک ماجرای زیبا", "درس شانزدهم: اسب طلایی", "درس هفدهم: آقای بهاری، خانم بهاری", "درس هجدهم: چشمان همیشه باز", "درس نوزدهم: خدا جون از تو ممنونم"],
     sience : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: زنگ علوم", "درس دوم: مخلوط ها در زندگی", "درس سوم: انرژی نیاز هر روز ما", "درس چهارم: انرژی الکتریکی", "درس پنجم: گرما و ماده", "درس ششم: سنگ ها", "درس هفتم: آهن ربا در زندگی", "درس هشتم: آسمان در شب", "درس نهم: بدن ما(1)", "درس دهم: بدن ما (2)", "درس یازدهم: بی مهره ها", "درس دوازدهم: گوناگونی گیاهان", "درس سیزدهم: زیستگاه"],
     history : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: محله ی ما", "فصل دوم: شهر من، روستای من", "فصل سوم: پیدایش شهر و روستا", "فصل چهارم: سفری به شهرهای باستانی", "فصل پنجم: کشور زیبای من", "فصل ششم: ما ایرانی هستیم"],
     art : ['همه'],
}

export const gradeFiveFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: آفرینش", "فصل دوم: دانایی و هوشیاری", "فصل سوم: ایرانِ من", "فصل چهارم: نام آوران", "فصل پنجم: راه زندگی", "فصل ششم: عِلم و عَمل"],
     math : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: عدد نویسی و الگوها", "فصل دوم: کسر", "فصل سوم: نسبت، تناسب و درصد", "فصل چهارم: تقارن و چند ضلعی ها", "فصل پنجم: عددهای اعشاری", "فصل ششم: اندازه گیری", "فصل هفتم: آمار و احتمال"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: نماز در قرآن", "درس دوم: یادآوری وقف بر حرکت", "درس سوم: یادآوری وقف بر ـه و ـه ی", "درس چهارم: یادآوری وقف ـۀ ۀ", "درس پنجم: التقاء ساکنین", "درس ششم: یادآوری حروف مقطّعه", "درس هفتم: یادآوری مدّ", "درس هشتم: وقف بر ـــًــ ا و ـــًــ ی", "درس نهم: یادآوری التقاء ساکنین", "درس دهم: یادآوری مد", "درس یازدهم: یادآوری وقف", "درس دوازدهم: سوره ی انبیاء" , "درس اول: دسته گلی از آسمان", "درس دوم: تنها او", "درس سوم: بانویی که یک سوره ی قرآن به نام اوست", "درس چهارم: از نوزاد بپرسید!", "درس پنجم: گل صد برگ", "درس ششم: مال مردم", "درس هفتم: رنگین کمان جمعه", "درس هشتم: دو نامه", "درس نهم: یک جهان جشن!", "درس دهم: در ساحل دجله", "درس یازدهم: سرو سربلند سامرا", "درس دوازدهم: خورشید پشت ابر", "درس سیزدهم: کوچک های بزرگ!", "درس چهاردهم: بزرگ مرد تاریخ", "درس پانزدهم: بهمن همیشه بهار", "درس شانزدهم: روزنامه های دیواری", "درس هفدهم: این ها و آنها"],
     sience : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: زنگ علوم", "درس دوم: ماده تغییر می کند", "درس سوم: رنگین کمان", "درس چهارم: برگی از تاریخ زمین", "درس پنجم: حرکت بدن", "درس ششم: چه خبر؟(1)", "درس هفتم: چه خبر؟(2)", "درس هشتم: کارها آسان می شود(1)", "درس نهم: کارها آسان می شود(2)", "درس دهم: خاک با ارزش", "درس یازدهم: بکارید، بخورید", "درس دوازدهم: از ریشه تا برگ"],
     history : ["همه", "نوبت اول", "دوره کل کتاب","فصل اول: زندگی با دیگران", "فصل دوم: سرزمین ما", "فصل سوم: زندگی در نواحی دیگر جهان", "فصل چهارم: زیارت مکان های مقدس", "فصل پنجم: ایران بعد از اسلام"],
     art : ['همه'],
}

export const gradeSixFilters = {
     persian : ["همه", "نوبت اول", "دوره کل کتاب", "فصل اوّل: آفرينش", "فصل دوم: دانایی و هوشیاری", "فصل سوم: ايران من", "فصل چهارم: نام آوران", "فصل پنجم: راهِ زندگی", "فصل ششم: علم و عمل"],
     math : ["همه", "نوبت اول", "دوره کل کتاب", "فصل اول: عدد و الگوهای عددی", "فصل دوم: کسر", "فصل سوم: اعداد اعشاری", "فصل چهارم: تقارن و مختصات", "فصل پنجم: اندازه گیری", "فصل شش: تناسب و درصد", "فصل هفت: تقریب"],
     quran : ["همه", "نوبت اول", "دوره کل کتاب","درس اول: سوره ی انفال (وقت نماز)", "درس دوم: سوره ی فتح (حتی یک وجب خاک)", "درس سوم: سوره ی فتح و حجرات (مومنان برادرند)", "درس چهارم: سوره ی حجرات (ملاک برتری)", "درس پنجم: سوره ی ق و ذاریات (گسترش آسمان)", "درس ششم: سوره ی ذاریات و طور (همیشه در تپش)", "درس هفتم: سوره ی قمر (نظم در آفرینش)" , "درس اول: تنها او", "درس دوم: تنها تو را می پرستیم", "درس سوم: جهان دیگر", "درس چهارم: یاد آن روز بزرگ", "درس پنجم: شتربان با ایمان", "درس ششم: سیمای خوبان", "درس هفتم: دست در دست دوست", "درس هشتم: دوران غیبت", "درس نهم: جهان دیگر", "درس دهم: آداب زندگی", "درس یازدهم: راه تندرستی", "درس دوازدهم: احکام سفر", "درس سیزدهم: عید مسلمانان", "درس چهاردهم: راز موفقیت", "درس پانزدهم: رهبر کوچک", "درس شانزدهم: زیارت", "درس هفدهم: دانش آموز نمونه"],
     sience : ["همه", "نوبت اول", "دوره کل کتاب", "درس اول: زنگ علوم", "درس دوم: سرگذشت دفتر من", "درس سوم: کارخانه ی کاغذ سازی", "درس چهارم: سفر به اعماق زمین", "درس پنجم: زمین پویا", "درس ششم: ورزش و نیرو (1)", "درس هفتم: ورزش و نیرو (2)", "درس هشتم: طراحی کنیم و بسازیم", "درس نهم: سفر انرژی", "درس دهم: خیلی کوچک، خیلی بزرگ", "درس یازدهم: شگفتی های برگ", "درس دوازدهم: جنگل برای کیست؟", "درس سیزدهم: سالم بمانیم", "درس چهاردهم: از گذشته تا آینده"],
     history : ["همه", "نوبت اول", "دوره کل کتاب", "فصل اول: دوستان ما", "فصل دوم: تصمیم گیری", "فصل سوم: کشاورزی در ایران", "فصل چهارم: ایران و منابع انرژی", "فصل پنجم: پیشرفت علوم و فنون در دوره‌ی اسلامی", "فصل ششم: سفری به اصفهان", "فصل هفتم: اوقات فراغت", "فصل هشتم: پوشاک ما", "فصل نهم: دریاهای ایران", "فصل دهم: ایران و همسایگان", "فصل یازدهم: ایستادگی در برابر بیگانگان", "فصل دوازدهم: آزادی خرمشهر"],
     thinking : ["همه", "نوبت اول", "دوره کل کتاب", ],
     technology : ["همه", "نوبت اول", "دوره کل کتاب", ],
     art : ['همه'],
}

export const filtersInfo = {
     price : ["همه", "فقط رایگان"],
     level : ["همه",'آسان','متوسط','تسلا' ],
     key : ["همه",'دارد', 'ندارد'],
     rotation : ["همه",'عمودی','افقی'],
     usableFor : ["همه","برای تمرین و آزمون","مخصوص آزمون" ,"مخصوص تمرین" ],

}