

export const filtersInfo = {
     sort : [
          "پیش فرض",
          "جدیدترین",
          "پربازدیدترین",
          "پربحث ترین",
          "محبوب ترین",
          "ارزان ترین",
          "گران ترین",
     ],
     _subject : [
          "همه",
          "ریاضی",
          "فارسی",
          "علوم و آزمایشگاه",
          "تاریخ و جغرافیا",
          "قرآن و هدیه ها",
          "هنر",
          "درک مطلب",
          "متفرقه"
     ],
     price : [
          "همه",
          "فقط رایگان",
     ],
}