export const gradeOneFilters = {
    "فارسی" : ["همه", "نوبت اول", "دوره کل کتاب","نگاره‌ی 1: به خانه‌ی ما خوش آمدی", "نگاره‌ 2: بچه ها، آماده!", "نگاره‌ی 3: یک٬ دو و سه راه مدرسه", "نگاره‌ی 4: به مدرسه رسیدیم", "نگاره‌ی 5: از کلاس ما چه خبر؟", "نگاره‌ی 6: بازی، بازی، تماشا", "نگاره‌ی 7: به به چه روستایی", "نگاره‌ی 8: چه دنیای قشنگی", "نگاره‌ی 9: در مسجد محله", "نگاره‌ی 10: نوروز در خانه‌ی ما", "درس 1: آ ا ــ بـ ب", "درس 2: اَ ـَ ــ د", "درس 3: مـ م ــ سـ س", "درس 4: او و ــ تـ ت", "درس 5: ر ــ نـ ن", "درس 6: ایـ یـ ی ای ــ ز", "درس 7: اِ ـِ ــ ـه ه ــ شـ ش", "درس 8: یـ ى ــ اُ ـُ", "درس 9: کـ ک ــ و", "درس 10: پـ پ ــ گـ گ", "درس 11: فـ ف ــ خـ خ", "درس 12: قـ ق ــ لـ ل", "درس 13: جـ ج ــ ـُ استثنا", "درس 14: هـ ـهـ ـه ه ــ چـ چ", "درس 15: ژ ــ خوا", "درس 16: در بازار ” تشدید ـّ “", "درس 17: صدایِ موج ”صـ ص“ ــ سفرِ دلپذیر ”ذ“", "درس 18: علی و معصومه ”عـ ـعـ ـع ع“ ــ مثلِ خورشید ”ثـ ث“", "درس 19: حَلَزون ”حـ ح“", "درس 20: رضا ”ضـ ض“ ــ خاطرات انقلاب ”ط“", "درس 21: لاک‌پشت و مرغابی‌ها ”غـ ـغـ ـغ غ“", "درس 22: پیامبر مهربان “ظ”"],
    "ریاضی" : ["همه", "نوبت اول", "دوره کل کتاب","شمارش اشیاء", "شمارش از روی شکل بدون شمردن", "اضافه کردن", "نوشتن اعداد", "مقدمه بر هندسه", "آموزش جمع و تفریق", "الگوی شطرنجی", "هندسه، تقارن، قرینه و اشکال هندسی"],
    "قرآن و هدیه ها" : ["همه", "نوبت اول", "دوره کل کتاب","درس اول : به نـام خـدا، بـسـم اللّه", "درس دوم : نعـمت هـای خدا", "درس سوم : خانـه ی مـا", "درس چهارم : قـرآن بـخـوانــيم", "درس پنجم : کودک مسـلمان", "درس ششم : مدرسـه ی ما", "درس هفتم : پيامبـران خـدا", "درس آخر : در تـابـسـتان نيز قرآن بخوانيم"],
    "علوم" : ["همه", "نوبت اول", "دوره کل کتاب","فصل 1: زنگ علوم", "فصل 2: سلام، به من نگاه کن!", "فصل 3: سالم باش، شاداب باش", "فصل 4: دنیای جانوران", "فصل 5: دنیای گیاهان", "فصل 6: زمین خانه ی پر آب ما", "فصل 7: زمین خانه ی سنگی ما", "فصل 8: چه می خواهم بسازم؟", "فصل 9: زمین خانه ی خاکی ما", "فصل 10: در اطراف ما هوا وجود دارد", "فصل 11: دنیای سرد و گرم", "فصل 12: از خانه تا مدرسه", "فصل 13: آهن ربای من", "فصل 14: از گذشته تا آینده"],
    "هنر" : ['همه'],
}

export const preSchool = {
    "فارسی" : ["همه"],
    "ریاضی" : ["همه"],
    "قرآن و هدیه ها" : ["همه"],
    "هنر" : ['همه'],
    "علوم" : ['همه'],
}

export const forTeachers = {
    "اختلالات" : ["همه","اختلالات نوشتاری", "اختلالات خوانداری", "اختلالات ریاضی"],
    "هنر" : ["همه", "تلفیق هنر و ریاضی" , "تلفیق هنر و فارسی", "سرود", "نمایش", "ابزارسازی", "اوریگامی", "رنگ آمیزی"]
}