import { CoursesFilteringTitlesProps } from "@/types/courses";


export const CoursesFilteringTitles : CoursesFilteringTitlesProps[] = [
    {
        id : 1,
        title : "دسته بندی موضوع",
        items : [
            "همه",
            "ریاضی و محاسبات",
            "زبان پارسی",
            "علوم و آزمایشگاه",
            "تاریخ و جغرافیا",
            "هنر و طراحی",
            "درک مطلب",
            "متفرقه",
        ]
    },
    {
        id : 2,
        title : "پایه تحصیلی",
        items : [
            "همه",
            "اول ابتدایی",
            "دوم ابتدایی",
            "سوم ابتدایی",
            "چهارم ابتدایی",
            "پنجم ابتدایی",
            "ششم ابتدایی",
        ]
    },
    {
        id : 3,
        title : "نوع مخاطب",
        items : [
            "همه",
            "دانش آموز",
            "آموزگاران و دانشجویان",
            "والدین دانش آموزان",
            "عمومی",
        ]
    },
    { 
        id : 4,
        title : "امتیاز",
        items : [
            "همه",
            "امتیاز بالاتر از ۵",
            "امتیاز بالاتر از ۴",
            "امتیاز بالاتر از ۳",
            "امتیاز بالاتر از ۲",
            "امتیاز بالاتر از ۱",
        ]
    },
    { 
        id : 5,
        title : "فیلتر های بیشتر ...",
        items : []
    },
    { 
        id : 6,
        title : "سازنده",
        items : [
            "همه",
            "راحت بخون",
            "سازندگان تاییدشده",
            "سازندگان معمولی"
        ]
    },
    { 
        id : 7,
        title : "تعداد شرکت کنندگان",
        items : [
            "همه",
            "پایین تر از ۱۰۰",
            "بین ۱۰۰ تا ۳۰۰",
            "بین ۳۰۱ تا ۵۰۰",
            "بین ۵۰۰ تا ۷۰۰",
            "بالاتر از ۱۰۰۰",
        ]
    },
    { 
        id : 8,
        title : "تعداد قسمت های دوره",
        items : [
            "همه",
            "پایین تر از ۵",
            "بین ۶ تا ۱۰",
            "بین ۱۱ تا ۱۵",
            "بین ۱۶ تا ۲۰",
            "بالاتر از ۲۱",
        ]
    },
    { 
        id : 9,
        title : "بازه قیمتی",
        items : []
    },
]