
export const CartsInfo = [
    {
        imgSrc : "./images/blog/front-view-desk-with-stacked-books-copy-space.jpg",
        imgAlt : "lorem",
        head : "چگونه کتاب بخوانیم که دیرتر فراموش کنیم ؟",
        para : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
        date : "۲۸ آبان 1397",
        author : "محمد زورمند",
        category : "متفرقه",
        comments : 3
    },
    {
        imgSrc : "./images/blog/front-view-desk-with-stacked-books-copy-space.jpg",
        imgAlt : "lorem",
        head : "چگونه کتاب بخوانیم که دیرتر فراموش کنیم ؟",
        para : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
        date : "۲۸ آبان 1397",
        author : "محمد زورمند",
        category : "متفرقه",
        comments : 3
    },
    {
        imgSrc : "./images/blog/front-view-desk-with-stacked-books-copy-space.jpg",
        imgAlt : "lorem",
        head : "چگونه کتاب بخوانیم که دیرتر فراموش کنیم ؟",
        para : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
        date : "۲۸ آبان 1397",
        author : "محمد زورمند",
        category : "متفرقه",
        comments : 3
    }
]