

export const filtersInfo = {
     sort : [
          "پیش فرض",
          "جدیدترین",
          "پربازدیدترین",
          "پربحث ترین",
          "محبوب ترین",
          "ارزان ترین",
          "گران ترین",
     ],
     grade : [
         "تمامی پایه ها",
         "اول",
         "دوم",
         "سوم",
         "چهارم",
         "پنجم",
         "ششم"
    ],
     book : [
         "تمامی دروس",
         "ریاضی",
         "فارسی",
         "علوم و آزمایشگاه",
         "تاریخ و جغرافیا",
         "قرآن و هدیه ها",
         "هنر",
         "درک مطلب",
         "متفرقه"
     ],
     price : [
          "تمامی کاربرگ ها",
          "رایگان",
          "کاربرگ های نقدی"
     ],
}